
## Plan Result




<pre><code>Plan: 15 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-PASS_V14[0]
  * azurerm_key_vault_secret.POSTGRES-USER_V14[0]
  * azurerm_key_vault_secret.POSTGRES_HOST_V14[0]
  * module.idam-testing-support-api-db[0].azurerm_postgresql_active_directory_administrator.admin
  * module.idam-testing-support-api-db[0].azurerm_resource_group.data-resourcegroup
  * module.idam-testing-support-api-db[0].azurerm_template_deployment.postgres-paas
  * module.idam-testing-support-api-db[0].null_resource.subnet_mappings[0]
  * module.idam-testing-support-api-db[0].null_resource.subnet_mappings[1]
  * module.idam-testing-support-api-db[0].null_resource.subnet_mappings[2]
  * module.idam-testing-support-api-db[0].null_resource.subnet_mappings[3]
  * module.idam-testing-support-api-db[0].null_resource.subnet_mappings[4]
  * module.idam-testing-support-api-db[0].null_resource.subnet_mappings[5]
  * module.idam-testing-support-api-db[0].null_resource.subnet_mappings[6]
  * module.idam-testing-support-api-db[0].null_resource.subnet_mappings[7]
  * module.idam-testing-support-api-db[0].random_string.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS_V14[0] will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS_V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-idam-aat/providers/Microsoft.KeyVault/vaults/idam-idam-aat"
      + name                    = "idam-testing-support-api-POSTGRES-PASS-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER_V14[0] will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER_V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-idam-aat/providers/Microsoft.KeyVault/vaults/idam-idam-aat"
      + name                    = "idam-testing-support-api-POSTGRES-USER-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST_V14[0] will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST_V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-idam-aat/providers/Microsoft.KeyVault/vaults/idam-idam-aat"
      + name                    = "idam-testing-support-api-POSTGRES-HOST-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.idam-testing-support-api-db[0].data.azurerm_postgresql_server.replica will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_postgresql_server" "replica" {
      + administrator_login = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + identity            = (known after apply)
      + location            = (known after apply)
      + name                = "idam-testing-support-api-idam-aat"
      + resource_group_name = "idam-testing-support-api-data-idam-aat"
      + sku_name            = (known after apply)
      + tags                = (known after apply)
      + version             = (known after apply)
    }

  # module.idam-testing-support-api-db[0].azurerm_postgresql_active_directory_administrator.admin will be created
  + resource "azurerm_postgresql_active_directory_administrator" "admin" {
      + id                  = (known after apply)
      + login               = "DTS Platform Operations"
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + resource_group_name = "idam-testing-support-api-data-idam-aat"
      + server_name         = "idam-testing-support-api-idam-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.idam-testing-support-api-db[0].azurerm_resource_group.data-resourcegroup will be created
  + resource "azurerm_resource_group" "data-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "idam-testing-support-api-data-idam-aat"
      + tags     = {
          + "application"         = "cft-idam"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/idam-testing-support-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#idam-support-cft"
          + "environment"         = "staging"
          + "managedBy"           = "IdAM"
        }
    }

  # module.idam-testing-support-api-db[0].azurerm_template_deployment.postgres-paas will be created
  + resource "azurerm_template_deployment" "postgres-paas" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "idam-testing-support-api-idam-aat"
      + outputs             = (known after apply)
      + parameters          = (known after apply)
      + resource_group_name = "idam-testing-support-api-data-idam-aat"
      + template_body       = jsonencode(
            {
              + "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + administratorLogin         = {
                      + maxLength = 16
                      + minLength = 1
                      + type      = "string"
                    }
                  + administratorLoginPassword = {
                      + type = "securestring"
                    }
                  + backupRetentionDays        = {
                      + defaultValue = 7
                      + type         = "string"
                    }
                  + charset                    = {
                      + type = "string"
                    }
                  + collation                  = {
                      + type = "string"
                    }
                  + commonTags                 = {
                      + type = "string"
                    }
                  + dbName                     = {
                      + type = "string"
                    }
                  + dbRules                    = {
                      + type = "string"
                    }
                  + env                        = {
                      + metadata = {
                          + description = "The tag"
                        }
                      + type     = "string"
                    }
                  + geoRedundantBackup         = {
                      + defaultValue = "Enabled"
                      + type         = "string"
                    }
                  + location                   = {
                      + allowedValues = [
                          + "UK West",
                          + "ukwest",
                          + "UK South",
                          + "uksouth",
                        ]
                      + defaultValue  = "UK South"
                      + type          = "string"
                    }
                  + serverName                 = {
                      + maxLength = 63
                      + minLength = 2
                      + type      = "string"
                    }
                  + skuCapacity                = {
                      + defaultValue = 2
                      + type         = "string"
                    }
                  + skuFamily                  = {
                      + allowedValues = [
                          + "Gen5",
                        ]
                      + defaultValue  = "Gen5"
                      + type          = "string"
                    }
                  + skuName                    = {
                      + allowedValues = [
                          + "B_Gen5_1",
                          + "B_Gen5_2",
                          + "GP_Gen5_2",
                          + "GP_Gen5_4",
                          + "GP_Gen5_8",
                          + "GP_Gen5_16",
                          + "GP_Gen5_32",
                          + "MO_Gen5_2",
                          + "MO_Gen5_4",
                          + "MO_Gen5_8",
                          + "MO_Gen5_16",
                          + "MO_Gen5_32",
                        ]
                      + defaultValue  = "GP_Gen5_2"
                      + type          = "string"
                    }
                  + skuSizeMB                  = {
                      + defaultValue = "51200"
                      + type         = "string"
                    }
                  + skuTier                    = {
                      + allowedValues = [
                          + "Basic",
                          + "GeneralPurpose",
                          + "MemoryOptimized",
                        ]
                      + defaultValue  = "GeneralPurpose"
                      + type          = "string"
                    }
                  + sslEnforcement             = {
                      + defaultValue = "Enabled"
                      + type         = "string"
                    }
                  + version                    = {
                      + allowedValues = [
                          + "9.5",
                          + "9.6",
                          + "10",
                          + "11",
                        ]
                      + defaultValue  = "9.6"
                      + type          = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-12-01-preview"
                      + kind       = ""
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('serverName')]"
                      + properties = {
                          + administratorLogin         = "[parameters('administratorLogin')]"
                          + administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          + sslEnforcement             = "[parameters('sslEnforcement')]"
                          + storageProfile             = {
                              + backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              + geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              + storageMB           = "[parameters('skuSizeMB')]"
                            }
                          + version                    = "[parameters('version')]"
                        }
                      + resources  = [
                          + {
                              + apiVersion = "2017-12-01-preview"
                              + dependsOn  = [
                                  + "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              + name       = "[parameters('dbName')]"
                              + properties = {
                                  + charset   = "[parameters('charset')]"
                                  + collation = "[parameters('collation')]"
                                }
                              + type       = "databases"
                            },
                        ]
                      + sku        = {
                          + capacity = "[parameters('skuCapacity')]"
                          + family   = "[parameters('skuFamily')]"
                          + name     = "[parameters('skuName')]"
                          + size     = "[parameters('skuSizeMB')]"
                          + tier     = "[parameters('skuTier')]"
                        }
                      + tags       = "[variables('tags')]"
                      + type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  + {
                      + apiVersion = "2017-12-01-preview"
                      + copy       = {
                          + count = "[length(variables('dbRules'))]"
                          + name  = "storagecopy"
                        }
                      + dependsOn  = [
                          + "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      + location   = "[parameters('location')]"
                      + name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      + properties = {
                          + ignoreMissingVnetServiceEndpoint = true
                          + virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      + type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              + variables      = {
                  + dbRules = "[base64ToJson(parameters('dbRules'))]"
                  + tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.idam-testing-support-api-db[0].null_resource.subnet_mappings[0] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "idamJumpBox"
          + "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat/subnets/core-infra-subnet-15-idam-aat"
        }
    }

  # module.idam-testing-support-api-db[0].null_resource.subnet_mappings[1] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "ase"
          + "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat/subnets/core-infra-subnet-2-idam-aat"
        }
    }

  # module.idam-testing-support-api-db[0].null_resource.subnet_mappings[2] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "aks-preview-00"
          + "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-preview/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-preview/subnets/aks-subnet"
        }
    }

  # module.idam-testing-support-api-db[0].null_resource.subnet_mappings[3] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "aks-aat-00"
          + "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-00"
        }
    }

  # module.idam-testing-support-api-db[0].null_resource.subnet_mappings[4] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "aks-aat-01"
          + "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-01"
        }
    }

  # module.idam-testing-support-api-db[0].null_resource.subnet_mappings[5] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "jumpbox-idam-aat2"
          + "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat2/subnets/core-infra-subnet-15-idam-aat2"
        }
    }

  # module.idam-testing-support-api-db[0].null_resource.subnet_mappings[6] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "jenkins-aks"
          + "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        }
    }

  # module.idam-testing-support-api-db[0].null_resource.subnet_mappings[7] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "jenkins-aks-agent"
          + "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        }
    }

  # module.idam-testing-support-api-db[0].random_string.password will be created
  + resource "random_string" "password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = true
      + upper       = true
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":350,"Program":"tfcmt","SHA1":"","Vars":{}} -->